Revit 2027 API
FlexDuct.FlexDuctType Property
 The flex duct type of this flex duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlexDuctType FlexDuctType { get; set; }
Public Property FlexDuctType As FlexDuctType
	Get
	Set
public:
property FlexDuctType^ FlexDuctType {
	FlexDuctType^ get ();
	void set (FlexDuctType^ value);
}
member FlexDuctType : FlexDuctType with get, set
Property Value
FlexDuctType
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace